# 함수(Function) : <함수명()>과 같은 형태로 쓰이는데 지금까지 사용해 온
# print(), input(), range(), list(), append(), remove() 등은 모두 함수이다.
# 또한 함수는 사용자가 함수명과 기능을 새롭게 정의해서 사용할 수도 있다.

# 함수로 '안녕하세요!' 출력하기
def hello():   # 함수 정의
    print("안녕하세요!")

hello()   # 함수 호출
hello()   # 함수 호출
hello()   # 함수 호출
# print() : 화면에 데이터 값을 출력함.
# input() : 키보드를 통해 데이터를 입력 받음.
# range() : 정수의 범위를 설정함.
# list() : 리스트를 생성함.
# int() : 문자열이나 실수형 숫자를 정수형 숫자로 변환함.
# float() : 문자열이나 정수형 숫자를 실수형 숫자로 변환함.
# str() : 정수형 숫자나 실수형 숫자를 문자열로 변환함.
# type() : 데이터의 형을 구함.